/*
############################################ ЗАДАНИЕ ###########################################
				Виртуальные функции
	Создайте иерархию классов по работе с файлами. Базовый класс должен
открывать файл и отображать его содержимое в консоль. Первый класс
потомка должен открывать файл и отображать его содержимое в виде ASCIIкодов символов, расположенных в файле.
	Второй производный класс должен
открывать файл и отображать его содержимое в шестнадцатеричном виде.
	Для отображения содержимого файла в базовом классе необходимо
определить виртуальную функцию.
	• void Display(const char * path);
	• path — путь к файлу.
	Потомки должны создать свою реализацию виртуальной функции.
################################################################################################
*/

#include <iostream>

int main()
{

}